app/Repo/admin/DataPasienRepo.php

        public static function get_data_petugas ($id_petugas) {
            $model = new \App\Models\DataPetugas();
            $model->where("id_petugas", $id_petugas);
            return $model->first();
---
SELECT *
FROM `data_petugas`
WHERE `id_petugas` = 'PET20240811111404188'
 LIMIT 1