app/Repo/admin/DataRekamMedisRepo.php

    public static function detail($proses)
    {
        $model = new self::$model();
        $model->where("id_rekam_medis", $proses);
        return $model->first();
---
SELECT *
FROM `data_rekam_medis`
WHERE `id_rekam_medis` = 'REK20240819015515797'
 LIMIT 1

    public static function get_data_pasien($id_pasien)
    {
        $model = new \App\Models\DataPasien();
        $model->where("id_pasien", $id_pasien);
        return $model->first();
---
SELECT *
FROM `data_pasien`
WHERE `id_pasien` = 'PAS20240817035126718'
 LIMIT 1

    public static function get_data_petugas($id_petugas)
    {
        $model = new \App\Models\DataPetugas();
        $model->where("id_petugas", $id_petugas);
        return $model->first();
---
SELECT *
FROM `data_petugas`
WHERE `id_petugas` = 'PET20240811111404188'
 LIMIT 1