app/Repo/admin/DataAnamnesisRepo.php

SELECT *
FROM `data_anamnesis`
WHERE `id_anamnesis` = 'ANA20240819015322511'
 LIMIT 1
---
    public static function detail($proses)
    {
        $model = new self::$model();
        $model->where("id_anamnesis", $proses);
        return $model->first();