app/Controllers/admin/DataPasien.php

    public function index()
    {
        $berdasarkan = $this->request->getPostGet("Berdasarkan");
        $isi = $this->request->getPostGet("isi");
        if ($berdasarkan && $isi) {
            $data_pasien = DataPasienRepo::tampil_berdasarkan($berdasarkan, $isi);
        } else {
            $data_pasien = DataPasienRepo::tampil();
        }
        $this->data['data_pasien'] = $data_pasien->paginate(15);
---
SELECT *
FROM `data_pasien`
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `data_pasien`