app/Controllers/admin/DataAnamnesis.php

    public function index()
    {
        $berdasarkan = $this->request->getPostGet("Berdasarkan");
        $isi = $this->request->getPostGet("isi");
        if ($berdasarkan && $isi) {
            $data_anamnesis = DataAnamnesisRepo::tampil_berdasarkan($berdasarkan, $isi);
        } else {
            $data_anamnesis = DataAnamnesisRepo::tampil();
        }
        $this->data['data_anamnesis'] = $data_anamnesis->paginate(15);
---
SELECT *
FROM `data_anamnesis`
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `data_anamnesis`