app/Controllers/admin/DataRekamMedis.php

    public function index()
    {
        $berdasarkan = $this->request->getPostGet("Berdasarkan");
        $isi = $this->request->getPostGet("isi");
        if ($berdasarkan && $isi) {
            $data_rekam_medis = DataRekamMedisRepo::tampil_berdasarkan($berdasarkan, $isi);
        } else {
            $data_rekam_medis = DataRekamMedisRepo::tampil();
        }
        $this->data['data_rekam_medis'] = $data_rekam_medis->paginate(15);
---
SELECT *
FROM `data_rekam_medis`
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `data_rekam_medis`