app/Controllers/admin/Login.php

SELECT *
FROM `data_admin`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function index()
    {
        if ($this->request->getPost() == null) {
            return view("tmp/" . Setting::instance()->lg . '/login');
        }

        $username = $this->request->getPostGet('username');
        $password = $this->request->getPostGet('password');

        $session = session();
        $model = new DataAdmin();
        $data = $model->where('username', $username)->first();